{
  "daemon-map/configUrl": {
    "type": "string",
    "description": "Url to a remote config. Values from the config file will be overrided by the properties of this component (if defined)!"
  },
  "daemon-map/cssClasses": {
    "type": "string",
    "description": "Name of CSS classes to add to the map's HTMLElement. Default CSS class `map` is not removed."
  },
  "daemon-map/backendUrl": {
    "type": "string",
    "description": "Sets the Backend URL address used by this map."
  },
  "daemon-map/projection": {
    "type": "string",
    "description": "Sets map projection (EPSG:CODE). If set, it will override config.map.projection property."
  },
  "daemon-map/latitude": {
    "type": "Number",
    "description": "Sets Latitude of map's center. If set, it will override config.map.latitude property."
  },
  "daemon-map/longitude": {
    "type": "Number",
    "description": "Sets Longitude of map's center. If set, it will override config.map.longitude property."
  },
  "daemon-map/zoom": {
    "type": "Number",
    "description": "Sets map zoom level. If set, it will override config.map.zoom property."
  },
  "daemon-map/rotation": {
    "type": "Number",
    "description": "Sets map rotation in degrees. If set, it will override config.map.rotation property."
  },
  "daemon-map/controls": {
    "type": "Object",
    "description": "Sets default map controls. If set, it will override config.map.controls property."
  },
  "daemon-map/interactions": {
    "type": "Object",
    "description": "Sets default map interactions. If set, it will override config.map.interactions property. Available boolean properties are: altShiftDragRotate, doubleClickZoom, dragPan, pinchRotate, pinchZoom, keyboard, mouseWheelZoom, shiftDragZoom"
  },
  "daemon-map/widgets": {
    "type": "Array<Object>",
    "description": "Sets default map widgets. If set, it will override config.widgets property. There is only one required property - name of the widget."
  },
  "daemon-map/layers": {
    "type": "Array<Object>",
    "description": "Sets operational layers for this map. If not empty, it will override config.map.layers property. Available boolean properties are: rotate, zoom, attribution, scale, mousePosition"
  },
  "daemon-map/basemaps": {
    "type": "Array<Object>",
    "description": "Sets basemaps for this map. If not empty, it will override config.map.basemaps property."
  },
  "daemon-map/@config-created": {
    "type": "Function",
    "description": "Event fired when the config is fetched and ready"
  },
  "daemon-map/@map-created": {
    "type": "Function",
    "description": "Event fired when the map is created"
  },
  "daemon-map/@map-rendered": {
    "type": "Function",
    "description": "Event fired when the map is rendered for the first time"
  }
}
